ir_version: 3
producer_name: ""
producer_version: ""
model_version: 0
graph {
  name: "mxnet_converted_model"
  node {
    input: "data"
    input: "scalar_op1"
    output: "_minusscalar0"
    name: "_minusscalar0"
    op_type: "Sub"
  }
  node {
    input: "_minusscalar0"
    input: "scalar_op2"
    output: "_mulscalar0"
    name: "_mulscalar0"
    op_type: "Mul"
  }
  node {
    input: "_mulscalar0"
    input: "conv_1_conv2d_weight"
    output: "conv_1_conv2d"
    name: "conv_1_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "conv_1_conv2d"
    input: "conv_1_batchnorm_gamma"
    input: "conv_1_batchnorm_beta"
    input: "conv_1_batchnorm_moving_mean"
    input: "conv_1_batchnorm_moving_var"
    output: "conv_1_batchnorm"
    name: "conv_1_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "conv_1_relu_gamma"
    input: "reshape11"
    output: "slope11"
    name: "slope11"
    op_type: "Reshape"
  }
  node {
    input: "conv_1_batchnorm"
    input: "slope11"
    output: "conv_1_relu"
    name: "conv_1_relu"
    op_type: "PRelu"
  }
  node {
    input: "conv_1_relu"
    input: "conv_2_dw_conv2d_weight"
    output: "conv_2_dw_conv2d"
    name: "conv_2_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 64
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv_2_dw_conv2d"
    input: "conv_2_dw_batchnorm_gamma"
    input: "conv_2_dw_batchnorm_beta"
    input: "conv_2_dw_batchnorm_moving_mean"
    input: "conv_2_dw_batchnorm_moving_var"
    output: "conv_2_dw_batchnorm"
    name: "conv_2_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "conv_2_dw_relu_gamma"
    input: "reshape20"
    output: "slope20"
    name: "slope20"
    op_type: "Reshape"
  }
  node {
    input: "conv_2_dw_batchnorm"
    input: "slope20"
    output: "conv_2_dw_relu"
    name: "conv_2_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "conv_2_dw_relu"
    input: "dconv_23_conv_sep_conv2d_weight"
    output: "dconv_23_conv_sep_conv2d"
    name: "dconv_23_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "dconv_23_conv_sep_conv2d"
    input: "dconv_23_conv_sep_batchnorm_gamma"
    input: "dconv_23_conv_sep_batchnorm_beta"
    input: "dconv_23_conv_sep_batchnorm_moving_mean"
    input: "dconv_23_conv_sep_batchnorm_moving_var"
    output: "dconv_23_conv_sep_batchnorm"
    name: "dconv_23_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "dconv_23_conv_sep_relu_gamma"
    input: "reshape29"
    output: "slope29"
    name: "slope29"
    op_type: "Reshape"
  }
  node {
    input: "dconv_23_conv_sep_batchnorm"
    input: "slope29"
    output: "dconv_23_conv_sep_relu"
    name: "dconv_23_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "dconv_23_conv_sep_relu"
    input: "dconv_23_conv_dw_conv2d_weight"
    output: "dconv_23_conv_dw_conv2d"
    name: "dconv_23_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 128
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "dconv_23_conv_dw_conv2d"
    input: "dconv_23_conv_dw_batchnorm_gamma"
    input: "dconv_23_conv_dw_batchnorm_beta"
    input: "dconv_23_conv_dw_batchnorm_moving_mean"
    input: "dconv_23_conv_dw_batchnorm_moving_var"
    output: "dconv_23_conv_dw_batchnorm"
    name: "dconv_23_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "dconv_23_conv_dw_relu_gamma"
    input: "reshape38"
    output: "slope38"
    name: "slope38"
    op_type: "Reshape"
  }
  node {
    input: "dconv_23_conv_dw_batchnorm"
    input: "slope38"
    output: "dconv_23_conv_dw_relu"
    name: "dconv_23_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "dconv_23_conv_dw_relu"
    input: "dconv_23_conv_proj_conv2d_weight"
    output: "dconv_23_conv_proj_conv2d"
    name: "dconv_23_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "dconv_23_conv_proj_conv2d"
    input: "dconv_23_conv_proj_batchnorm_gamma"
    input: "dconv_23_conv_proj_batchnorm_beta"
    input: "dconv_23_conv_proj_batchnorm_moving_mean"
    input: "dconv_23_conv_proj_batchnorm_moving_var"
    output: "dconv_23_conv_proj_batchnorm"
    name: "dconv_23_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "dconv_23_conv_proj_batchnorm"
    input: "res_3_block0_conv_sep_conv2d_weight"
    output: "res_3_block0_conv_sep_conv2d"
    name: "res_3_block0_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block0_conv_sep_conv2d"
    input: "res_3_block0_conv_sep_batchnorm_gamma"
    input: "res_3_block0_conv_sep_batchnorm_beta"
    input: "res_3_block0_conv_sep_batchnorm_moving_mean"
    input: "res_3_block0_conv_sep_batchnorm_moving_var"
    output: "res_3_block0_conv_sep_batchnorm"
    name: "res_3_block0_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block0_conv_sep_relu_gamma"
    input: "reshape54"
    output: "slope54"
    name: "slope54"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block0_conv_sep_batchnorm"
    input: "slope54"
    output: "res_3_block0_conv_sep_relu"
    name: "res_3_block0_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block0_conv_sep_relu"
    input: "res_3_block0_conv_dw_conv2d_weight"
    output: "res_3_block0_conv_dw_conv2d"
    name: "res_3_block0_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 128
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block0_conv_dw_conv2d"
    input: "res_3_block0_conv_dw_batchnorm_gamma"
    input: "res_3_block0_conv_dw_batchnorm_beta"
    input: "res_3_block0_conv_dw_batchnorm_moving_mean"
    input: "res_3_block0_conv_dw_batchnorm_moving_var"
    output: "res_3_block0_conv_dw_batchnorm"
    name: "res_3_block0_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block0_conv_dw_relu_gamma"
    input: "reshape63"
    output: "slope63"
    name: "slope63"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block0_conv_dw_batchnorm"
    input: "slope63"
    output: "res_3_block0_conv_dw_relu"
    name: "res_3_block0_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block0_conv_dw_relu"
    input: "res_3_block0_conv_proj_conv2d_weight"
    output: "res_3_block0_conv_proj_conv2d"
    name: "res_3_block0_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block0_conv_proj_conv2d"
    input: "res_3_block0_conv_proj_batchnorm_gamma"
    input: "res_3_block0_conv_proj_batchnorm_beta"
    input: "res_3_block0_conv_proj_batchnorm_moving_mean"
    input: "res_3_block0_conv_proj_batchnorm_moving_var"
    output: "res_3_block0_conv_proj_batchnorm"
    name: "res_3_block0_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block0_conv_proj_batchnorm"
    input: "dconv_23_conv_proj_batchnorm"
    output: "_plus0"
    name: "_plus0"
    op_type: "Add"
  }
  node {
    input: "_plus0"
    input: "res_3_block1_conv_sep_conv2d_weight"
    output: "res_3_block1_conv_sep_conv2d"
    name: "res_3_block1_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block1_conv_sep_conv2d"
    input: "res_3_block1_conv_sep_batchnorm_gamma"
    input: "res_3_block1_conv_sep_batchnorm_beta"
    input: "res_3_block1_conv_sep_batchnorm_moving_mean"
    input: "res_3_block1_conv_sep_batchnorm_moving_var"
    output: "res_3_block1_conv_sep_batchnorm"
    name: "res_3_block1_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block1_conv_sep_relu_gamma"
    input: "reshape80"
    output: "slope80"
    name: "slope80"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block1_conv_sep_batchnorm"
    input: "slope80"
    output: "res_3_block1_conv_sep_relu"
    name: "res_3_block1_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block1_conv_sep_relu"
    input: "res_3_block1_conv_dw_conv2d_weight"
    output: "res_3_block1_conv_dw_conv2d"
    name: "res_3_block1_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 128
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block1_conv_dw_conv2d"
    input: "res_3_block1_conv_dw_batchnorm_gamma"
    input: "res_3_block1_conv_dw_batchnorm_beta"
    input: "res_3_block1_conv_dw_batchnorm_moving_mean"
    input: "res_3_block1_conv_dw_batchnorm_moving_var"
    output: "res_3_block1_conv_dw_batchnorm"
    name: "res_3_block1_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block1_conv_dw_relu_gamma"
    input: "reshape89"
    output: "slope89"
    name: "slope89"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block1_conv_dw_batchnorm"
    input: "slope89"
    output: "res_3_block1_conv_dw_relu"
    name: "res_3_block1_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block1_conv_dw_relu"
    input: "res_3_block1_conv_proj_conv2d_weight"
    output: "res_3_block1_conv_proj_conv2d"
    name: "res_3_block1_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block1_conv_proj_conv2d"
    input: "res_3_block1_conv_proj_batchnorm_gamma"
    input: "res_3_block1_conv_proj_batchnorm_beta"
    input: "res_3_block1_conv_proj_batchnorm_moving_mean"
    input: "res_3_block1_conv_proj_batchnorm_moving_var"
    output: "res_3_block1_conv_proj_batchnorm"
    name: "res_3_block1_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block1_conv_proj_batchnorm"
    input: "_plus0"
    output: "_plus1"
    name: "_plus1"
    op_type: "Add"
  }
  node {
    input: "_plus1"
    input: "res_3_block2_conv_sep_conv2d_weight"
    output: "res_3_block2_conv_sep_conv2d"
    name: "res_3_block2_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block2_conv_sep_conv2d"
    input: "res_3_block2_conv_sep_batchnorm_gamma"
    input: "res_3_block2_conv_sep_batchnorm_beta"
    input: "res_3_block2_conv_sep_batchnorm_moving_mean"
    input: "res_3_block2_conv_sep_batchnorm_moving_var"
    output: "res_3_block2_conv_sep_batchnorm"
    name: "res_3_block2_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block2_conv_sep_relu_gamma"
    input: "reshape106"
    output: "slope106"
    name: "slope106"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block2_conv_sep_batchnorm"
    input: "slope106"
    output: "res_3_block2_conv_sep_relu"
    name: "res_3_block2_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block2_conv_sep_relu"
    input: "res_3_block2_conv_dw_conv2d_weight"
    output: "res_3_block2_conv_dw_conv2d"
    name: "res_3_block2_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 128
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block2_conv_dw_conv2d"
    input: "res_3_block2_conv_dw_batchnorm_gamma"
    input: "res_3_block2_conv_dw_batchnorm_beta"
    input: "res_3_block2_conv_dw_batchnorm_moving_mean"
    input: "res_3_block2_conv_dw_batchnorm_moving_var"
    output: "res_3_block2_conv_dw_batchnorm"
    name: "res_3_block2_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block2_conv_dw_relu_gamma"
    input: "reshape115"
    output: "slope115"
    name: "slope115"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block2_conv_dw_batchnorm"
    input: "slope115"
    output: "res_3_block2_conv_dw_relu"
    name: "res_3_block2_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block2_conv_dw_relu"
    input: "res_3_block2_conv_proj_conv2d_weight"
    output: "res_3_block2_conv_proj_conv2d"
    name: "res_3_block2_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block2_conv_proj_conv2d"
    input: "res_3_block2_conv_proj_batchnorm_gamma"
    input: "res_3_block2_conv_proj_batchnorm_beta"
    input: "res_3_block2_conv_proj_batchnorm_moving_mean"
    input: "res_3_block2_conv_proj_batchnorm_moving_var"
    output: "res_3_block2_conv_proj_batchnorm"
    name: "res_3_block2_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block2_conv_proj_batchnorm"
    input: "_plus1"
    output: "_plus2"
    name: "_plus2"
    op_type: "Add"
  }
  node {
    input: "_plus2"
    input: "res_3_block3_conv_sep_conv2d_weight"
    output: "res_3_block3_conv_sep_conv2d"
    name: "res_3_block3_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block3_conv_sep_conv2d"
    input: "res_3_block3_conv_sep_batchnorm_gamma"
    input: "res_3_block3_conv_sep_batchnorm_beta"
    input: "res_3_block3_conv_sep_batchnorm_moving_mean"
    input: "res_3_block3_conv_sep_batchnorm_moving_var"
    output: "res_3_block3_conv_sep_batchnorm"
    name: "res_3_block3_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block3_conv_sep_relu_gamma"
    input: "reshape132"
    output: "slope132"
    name: "slope132"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block3_conv_sep_batchnorm"
    input: "slope132"
    output: "res_3_block3_conv_sep_relu"
    name: "res_3_block3_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block3_conv_sep_relu"
    input: "res_3_block3_conv_dw_conv2d_weight"
    output: "res_3_block3_conv_dw_conv2d"
    name: "res_3_block3_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 128
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block3_conv_dw_conv2d"
    input: "res_3_block3_conv_dw_batchnorm_gamma"
    input: "res_3_block3_conv_dw_batchnorm_beta"
    input: "res_3_block3_conv_dw_batchnorm_moving_mean"
    input: "res_3_block3_conv_dw_batchnorm_moving_var"
    output: "res_3_block3_conv_dw_batchnorm"
    name: "res_3_block3_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block3_conv_dw_relu_gamma"
    input: "reshape141"
    output: "slope141"
    name: "slope141"
    op_type: "Reshape"
  }
  node {
    input: "res_3_block3_conv_dw_batchnorm"
    input: "slope141"
    output: "res_3_block3_conv_dw_relu"
    name: "res_3_block3_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_3_block3_conv_dw_relu"
    input: "res_3_block3_conv_proj_conv2d_weight"
    output: "res_3_block3_conv_proj_conv2d"
    name: "res_3_block3_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_3_block3_conv_proj_conv2d"
    input: "res_3_block3_conv_proj_batchnorm_gamma"
    input: "res_3_block3_conv_proj_batchnorm_beta"
    input: "res_3_block3_conv_proj_batchnorm_moving_mean"
    input: "res_3_block3_conv_proj_batchnorm_moving_var"
    output: "res_3_block3_conv_proj_batchnorm"
    name: "res_3_block3_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_3_block3_conv_proj_batchnorm"
    input: "_plus2"
    output: "_plus3"
    name: "_plus3"
    op_type: "Add"
  }
  node {
    input: "_plus3"
    input: "dconv_34_conv_sep_conv2d_weight"
    output: "dconv_34_conv_sep_conv2d"
    name: "dconv_34_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "dconv_34_conv_sep_conv2d"
    input: "dconv_34_conv_sep_batchnorm_gamma"
    input: "dconv_34_conv_sep_batchnorm_beta"
    input: "dconv_34_conv_sep_batchnorm_moving_mean"
    input: "dconv_34_conv_sep_batchnorm_moving_var"
    output: "dconv_34_conv_sep_batchnorm"
    name: "dconv_34_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "dconv_34_conv_sep_relu_gamma"
    input: "reshape158"
    output: "slope158"
    name: "slope158"
    op_type: "Reshape"
  }
  node {
    input: "dconv_34_conv_sep_batchnorm"
    input: "slope158"
    output: "dconv_34_conv_sep_relu"
    name: "dconv_34_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "dconv_34_conv_sep_relu"
    input: "dconv_34_conv_dw_conv2d_weight"
    output: "dconv_34_conv_dw_conv2d"
    name: "dconv_34_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "dconv_34_conv_dw_conv2d"
    input: "dconv_34_conv_dw_batchnorm_gamma"
    input: "dconv_34_conv_dw_batchnorm_beta"
    input: "dconv_34_conv_dw_batchnorm_moving_mean"
    input: "dconv_34_conv_dw_batchnorm_moving_var"
    output: "dconv_34_conv_dw_batchnorm"
    name: "dconv_34_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "dconv_34_conv_dw_relu_gamma"
    input: "reshape167"
    output: "slope167"
    name: "slope167"
    op_type: "Reshape"
  }
  node {
    input: "dconv_34_conv_dw_batchnorm"
    input: "slope167"
    output: "dconv_34_conv_dw_relu"
    name: "dconv_34_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "dconv_34_conv_dw_relu"
    input: "dconv_34_conv_proj_conv2d_weight"
    output: "dconv_34_conv_proj_conv2d"
    name: "dconv_34_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "dconv_34_conv_proj_conv2d"
    input: "dconv_34_conv_proj_batchnorm_gamma"
    input: "dconv_34_conv_proj_batchnorm_beta"
    input: "dconv_34_conv_proj_batchnorm_moving_mean"
    input: "dconv_34_conv_proj_batchnorm_moving_var"
    output: "dconv_34_conv_proj_batchnorm"
    name: "dconv_34_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "dconv_34_conv_proj_batchnorm"
    input: "res_4_block0_conv_sep_conv2d_weight"
    output: "res_4_block0_conv_sep_conv2d"
    name: "res_4_block0_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block0_conv_sep_conv2d"
    input: "res_4_block0_conv_sep_batchnorm_gamma"
    input: "res_4_block0_conv_sep_batchnorm_beta"
    input: "res_4_block0_conv_sep_batchnorm_moving_mean"
    input: "res_4_block0_conv_sep_batchnorm_moving_var"
    output: "res_4_block0_conv_sep_batchnorm"
    name: "res_4_block0_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block0_conv_sep_relu_gamma"
    input: "reshape183"
    output: "slope183"
    name: "slope183"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block0_conv_sep_batchnorm"
    input: "slope183"
    output: "res_4_block0_conv_sep_relu"
    name: "res_4_block0_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block0_conv_sep_relu"
    input: "res_4_block0_conv_dw_conv2d_weight"
    output: "res_4_block0_conv_dw_conv2d"
    name: "res_4_block0_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block0_conv_dw_conv2d"
    input: "res_4_block0_conv_dw_batchnorm_gamma"
    input: "res_4_block0_conv_dw_batchnorm_beta"
    input: "res_4_block0_conv_dw_batchnorm_moving_mean"
    input: "res_4_block0_conv_dw_batchnorm_moving_var"
    output: "res_4_block0_conv_dw_batchnorm"
    name: "res_4_block0_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block0_conv_dw_relu_gamma"
    input: "reshape192"
    output: "slope192"
    name: "slope192"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block0_conv_dw_batchnorm"
    input: "slope192"
    output: "res_4_block0_conv_dw_relu"
    name: "res_4_block0_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block0_conv_dw_relu"
    input: "res_4_block0_conv_proj_conv2d_weight"
    output: "res_4_block0_conv_proj_conv2d"
    name: "res_4_block0_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block0_conv_proj_conv2d"
    input: "res_4_block0_conv_proj_batchnorm_gamma"
    input: "res_4_block0_conv_proj_batchnorm_beta"
    input: "res_4_block0_conv_proj_batchnorm_moving_mean"
    input: "res_4_block0_conv_proj_batchnorm_moving_var"
    output: "res_4_block0_conv_proj_batchnorm"
    name: "res_4_block0_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block0_conv_proj_batchnorm"
    input: "dconv_34_conv_proj_batchnorm"
    output: "_plus4"
    name: "_plus4"
    op_type: "Add"
  }
  node {
    input: "_plus4"
    input: "res_4_block1_conv_sep_conv2d_weight"
    output: "res_4_block1_conv_sep_conv2d"
    name: "res_4_block1_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block1_conv_sep_conv2d"
    input: "res_4_block1_conv_sep_batchnorm_gamma"
    input: "res_4_block1_conv_sep_batchnorm_beta"
    input: "res_4_block1_conv_sep_batchnorm_moving_mean"
    input: "res_4_block1_conv_sep_batchnorm_moving_var"
    output: "res_4_block1_conv_sep_batchnorm"
    name: "res_4_block1_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block1_conv_sep_relu_gamma"
    input: "reshape209"
    output: "slope209"
    name: "slope209"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block1_conv_sep_batchnorm"
    input: "slope209"
    output: "res_4_block1_conv_sep_relu"
    name: "res_4_block1_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block1_conv_sep_relu"
    input: "res_4_block1_conv_dw_conv2d_weight"
    output: "res_4_block1_conv_dw_conv2d"
    name: "res_4_block1_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block1_conv_dw_conv2d"
    input: "res_4_block1_conv_dw_batchnorm_gamma"
    input: "res_4_block1_conv_dw_batchnorm_beta"
    input: "res_4_block1_conv_dw_batchnorm_moving_mean"
    input: "res_4_block1_conv_dw_batchnorm_moving_var"
    output: "res_4_block1_conv_dw_batchnorm"
    name: "res_4_block1_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block1_conv_dw_relu_gamma"
    input: "reshape218"
    output: "slope218"
    name: "slope218"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block1_conv_dw_batchnorm"
    input: "slope218"
    output: "res_4_block1_conv_dw_relu"
    name: "res_4_block1_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block1_conv_dw_relu"
    input: "res_4_block1_conv_proj_conv2d_weight"
    output: "res_4_block1_conv_proj_conv2d"
    name: "res_4_block1_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block1_conv_proj_conv2d"
    input: "res_4_block1_conv_proj_batchnorm_gamma"
    input: "res_4_block1_conv_proj_batchnorm_beta"
    input: "res_4_block1_conv_proj_batchnorm_moving_mean"
    input: "res_4_block1_conv_proj_batchnorm_moving_var"
    output: "res_4_block1_conv_proj_batchnorm"
    name: "res_4_block1_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block1_conv_proj_batchnorm"
    input: "_plus4"
    output: "_plus5"
    name: "_plus5"
    op_type: "Add"
  }
  node {
    input: "_plus5"
    input: "res_4_block2_conv_sep_conv2d_weight"
    output: "res_4_block2_conv_sep_conv2d"
    name: "res_4_block2_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block2_conv_sep_conv2d"
    input: "res_4_block2_conv_sep_batchnorm_gamma"
    input: "res_4_block2_conv_sep_batchnorm_beta"
    input: "res_4_block2_conv_sep_batchnorm_moving_mean"
    input: "res_4_block2_conv_sep_batchnorm_moving_var"
    output: "res_4_block2_conv_sep_batchnorm"
    name: "res_4_block2_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block2_conv_sep_relu_gamma"
    input: "reshape235"
    output: "slope235"
    name: "slope235"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block2_conv_sep_batchnorm"
    input: "slope235"
    output: "res_4_block2_conv_sep_relu"
    name: "res_4_block2_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block2_conv_sep_relu"
    input: "res_4_block2_conv_dw_conv2d_weight"
    output: "res_4_block2_conv_dw_conv2d"
    name: "res_4_block2_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block2_conv_dw_conv2d"
    input: "res_4_block2_conv_dw_batchnorm_gamma"
    input: "res_4_block2_conv_dw_batchnorm_beta"
    input: "res_4_block2_conv_dw_batchnorm_moving_mean"
    input: "res_4_block2_conv_dw_batchnorm_moving_var"
    output: "res_4_block2_conv_dw_batchnorm"
    name: "res_4_block2_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block2_conv_dw_relu_gamma"
    input: "reshape244"
    output: "slope244"
    name: "slope244"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block2_conv_dw_batchnorm"
    input: "slope244"
    output: "res_4_block2_conv_dw_relu"
    name: "res_4_block2_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block2_conv_dw_relu"
    input: "res_4_block2_conv_proj_conv2d_weight"
    output: "res_4_block2_conv_proj_conv2d"
    name: "res_4_block2_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block2_conv_proj_conv2d"
    input: "res_4_block2_conv_proj_batchnorm_gamma"
    input: "res_4_block2_conv_proj_batchnorm_beta"
    input: "res_4_block2_conv_proj_batchnorm_moving_mean"
    input: "res_4_block2_conv_proj_batchnorm_moving_var"
    output: "res_4_block2_conv_proj_batchnorm"
    name: "res_4_block2_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block2_conv_proj_batchnorm"
    input: "_plus5"
    output: "_plus6"
    name: "_plus6"
    op_type: "Add"
  }
  node {
    input: "_plus6"
    input: "res_4_block3_conv_sep_conv2d_weight"
    output: "res_4_block3_conv_sep_conv2d"
    name: "res_4_block3_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block3_conv_sep_conv2d"
    input: "res_4_block3_conv_sep_batchnorm_gamma"
    input: "res_4_block3_conv_sep_batchnorm_beta"
    input: "res_4_block3_conv_sep_batchnorm_moving_mean"
    input: "res_4_block3_conv_sep_batchnorm_moving_var"
    output: "res_4_block3_conv_sep_batchnorm"
    name: "res_4_block3_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block3_conv_sep_relu_gamma"
    input: "reshape261"
    output: "slope261"
    name: "slope261"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block3_conv_sep_batchnorm"
    input: "slope261"
    output: "res_4_block3_conv_sep_relu"
    name: "res_4_block3_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block3_conv_sep_relu"
    input: "res_4_block3_conv_dw_conv2d_weight"
    output: "res_4_block3_conv_dw_conv2d"
    name: "res_4_block3_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block3_conv_dw_conv2d"
    input: "res_4_block3_conv_dw_batchnorm_gamma"
    input: "res_4_block3_conv_dw_batchnorm_beta"
    input: "res_4_block3_conv_dw_batchnorm_moving_mean"
    input: "res_4_block3_conv_dw_batchnorm_moving_var"
    output: "res_4_block3_conv_dw_batchnorm"
    name: "res_4_block3_conv_dw_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block3_conv_dw_relu_gamma"
    input: "reshape270"
    output: "slope270"
    name: "slope270"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block3_conv_dw_batchnorm"
    input: "slope270"
    output: "res_4_block3_conv_dw_relu"
    name: "res_4_block3_conv_dw_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block3_conv_dw_relu"
    input: "res_4_block3_conv_proj_conv2d_weight"
    output: "res_4_block3_conv_proj_conv2d"
    name: "res_4_block3_conv_proj_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block3_conv_proj_conv2d"
    input: "res_4_block3_conv_proj_batchnorm_gamma"
    input: "res_4_block3_conv_proj_batchnorm_beta"
    input: "res_4_block3_conv_proj_batchnorm_moving_mean"
    input: "res_4_block3_conv_proj_batchnorm_moving_var"
    output: "res_4_block3_conv_proj_batchnorm"
    name: "res_4_block3_conv_proj_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block3_conv_proj_batchnorm"
    input: "_plus6"
    output: "_plus7"
    name: "_plus7"
    op_type: "Add"
  }
  node {
    input: "_plus7"
    input: "res_4_block4_conv_sep_conv2d_weight"
    output: "res_4_block4_conv_sep_conv2d"
    name: "res_4_block4_conv_sep_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block4_conv_sep_conv2d"
    input: "res_4_block4_conv_sep_batchnorm_gamma"
    input: "res_4_block4_conv_sep_batchnorm_beta"
    input: "res_4_block4_conv_sep_batchnorm_moving_mean"
    input: "res_4_block4_conv_sep_batchnorm_moving_var"
    output: "res_4_block4_conv_sep_batchnorm"
    name: "res_4_block4_conv_sep_batchnorm"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 0.0010000000474974513
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "res_4_block4_conv_sep_relu_gamma"
    input: "reshape287"
    output: "slope287"
    name: "slope287"
    op_type: "Reshape"
  }
  node {
    input: "res_4_block4_conv_sep_batchnorm"
    input: "slope287"
    output: "res_4_block4_conv_sep_relu"
    name: "res_4_block4_conv_sep_relu"
    op_type: "PRelu"
  }
  node {
    input: "res_4_block4_conv_sep_relu"
    input: "res_4_block4_conv_dw_conv2d_weight"
    output: "res_4_block4_conv_dw_conv2d"
    name: "res_4_block4_conv_dw_conv2d"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "res_4_block4_conv_dw_conv2d"
    input: "res_4_block4_conv_dw_batchnorm_gamma"
    input: "res_4_block4_conv_dw_batchnorm_beta"
    input: "res_4_block4_conv_dw_batchnorm_moving_mean"
